def insertion_sort(arr):
    # Проходимо по всім елементам списку, починаючи з другого
    for i in range(1, len(arr)):
        key = arr[i]  # Поточний елемент, який потрібно вставити в відсортовану частину списку
        j = i - 1  # Індекс попереднього елемента відносно поточного

        # Переміщуємо всі елементи, більші за key, на одну позицію вправо
        # доки не знайдемо правильну позицію для вставки key
        while j >= 0 and arr[j] > key:
            arr[j + 1] = arr[j]
            j -= 1

        # Вставляємо key на знайдену позицію
        arr[j + 1] = key

# Приклад використання
numbers = [5, 2, 8, 12, 1, 6]
insertion_sort(numbers)
print(numbers)
